In [4]:
import pandas as pd

df = pd.read_csv('sales.csv')
df

  month  eggs  salt  spam
0   Jan    47  12.0    17
1   Feb   110  50.0    31
2   Mar   221  89.0    72
3   Apr    77  87.0    20
4   May   132   NaN    52
5   Jun   205  60.0    55

In [5]:
df = pd.read_csv('sales.csv', index_col='month')

In [6]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

## Indexing using square brackets

In [7]:
df['salt']['Jan']

12.0

In [9]:
df.eggs['Mar']

221

In [11]:
df.salt['Apr']

87.0

In [12]:
df.loc['May', 'spam']

52

In [13]:
df.iloc[4,2]

52

In [15]:
df_new = df[['salt', 'eggs']]
df_new

       salt  eggs
month
Jan    12.0    47
Feb    50.0   110
Mar    89.0   221
Apr    87.0    77
May     NaN   132
Jun    60.0   205

In [16]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

## Selecting a column

In [17]:
df['eggs']

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [22]:
df['eggs'].values

array([ 47, 110, 221,  77, 132, 205])

In [23]:
df['eggs'].value_counts()

47     1
110    1
221    1
132    1
205    1
77     1
Name: eggs, dtype: int64

In [24]:
df['eggs'][1:4]

month
Feb    110
Mar    221
Apr     77
Name: eggs, dtype: int64

In [27]:
df['eggs'][4] # value associated with May

132

In [28]:
df.loc[:, 'eggs':'salt'] # all rows, some columns

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN
Jun     205  60.0

In [30]:
df.loc['Jan':'Apr', :] # some rows, all columns

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20

In [31]:
df.loc['Mar':'May', 'salt':'spam']

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

In [32]:
df.iloc[2:5, 1:] # a block from middle

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

In [34]:
df.loc['Jan':'May', ['eggs', 'spam']] # using lists rather than slices

       eggs  spam
month
Jan      47    17
Feb     110    31
Mar     221    72
Apr      77    20
May     132    52

In [35]:
df.iloc[[0,4,5], 0:2]

       eggs  salt
month
Jan      47  12.0
May     132   NaN
Jun     205  60.0

In [36]:
df['eggs']

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [37]:
type(df['eggs'])

pandas.core.series.Series

In [38]:
df[['eggs']]

       eggs
month
Jan      47
Feb     110
Mar     221
Apr      77
May     132
Jun     205

In [39]:
type(df[['eggs']])

pandas.core.frame.DataFrame

## Filtering DataFrames

### Creating a Boolean Series

In [40]:
df.salt > 60

month
Jan    False
Feb    False
Mar     True
Apr     True
May    False
Jun    False
Name: salt, dtype: bool

### Filtering with a Boolean Series

In [42]:
df[df.salt > 60]

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

In [43]:
enough_salt_sold = df.salt > 60
df[enough_salt_sold]

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

### Combining filters

In [44]:
df[(df.salt >= 50) & (df.eggs < 200)] # BOTH conditions

       eggs  salt  spam
month
Feb     110  50.0    31
Apr      77  87.0    20

In [45]:
df[(df.salt >= 50) | (df.eggs < 200)] # Either condition

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

## DataFrames with zeros and NaNs

In [46]:
df2 = df.copy()

In [47]:
df2

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [48]:
df2['bacon'] = [0, 0, 50, 60, 70, 80]

In [49]:
df2

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0    55     80

### Select columns with all nonzeros

In [50]:
df2.loc[:, df2.all()]

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

Select columns with any nonzeros at all

In [51]:
df2.loc[:, df2.any()]

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0    55     80

### Select columns with any NaNs

In [52]:
df.loc[:, df.isnull().any()]

       salt
month
Jan    12.0
Feb    50.0
Mar    89.0
Apr    87.0
May     NaN
Jun    60.0

### Select columns without NaNs

In [53]:
df.loc[:, df.notnull().all()]

       eggs  spam
month
Jan      47    17
Feb     110    31
Mar     221    72
Apr      77    20
May     132    52
Jun     205    55

### Drop rows with any NaNs

In [55]:
df.dropna(how='any') # May got dropped

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
Jun     205  60.0    55

## Filtering a column based on another

In [57]:
df.eggs[df.salt > 55] # return the egg column of the months whose salt > 50

month
Mar    221
Apr     77
Jun    205
Name: eggs, dtype: int64

## Modifying a column based on another

In [67]:
df.eggs[df.salt > 55] += 5

In [68]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     226  89.0    72
Apr      82  87.0    20
May     132   NaN    52
Jun     210  60.0    55

# Transforming DataFrames

### DataFrame vectorized methods

In [70]:
df.floordiv(12) # convert to dozens unit

       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      18   7.0     6
Apr       6   7.0     1
May      11   NaN     4
Jun      17   5.0     4

### NumPy vectorized functions

In [71]:
import numpy as np
np.floor_divide(df, 12) # convert to dozens unit

       eggs  salt  spam
month
Jan     3.0   1.0   1.0
Feb     9.0   4.0   2.0
Mar    18.0   7.0   6.0
Apr     6.0   7.0   1.0
May    11.0   NaN   4.0
Jun    17.0   5.0   4.0

## Plain Python functions

In [72]:
def dozens(n):
    return n//12

df.apply(dozens)

       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      18   7.0     6
Apr       6   7.0     1
May      11   NaN     4
Jun      17   5.0     4

In [73]:
df.apply(lambda n: n//12)

       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      18   7.0     6
Apr       6   7.0     1
May      11   NaN     4
Jun      17   5.0     4

Storing a Transformation

In [75]:
df['dozens_of_eggs'] = df.eggs.floordiv(12)
df

       eggs  salt  spam  dozens_of_eggs
month
Jan      47  12.0    17               3
Feb     110  50.0    31               9
Mar     226  89.0    72              18
Apr      82  87.0    20               6
May     132   NaN    52              11
Jun     210  60.0    55              17

### The DataFrame index

In [76]:
df

       eggs  salt  spam  dozens_of_eggs
month
Jan      47  12.0    17               3
Feb     110  50.0    31               9
Mar     226  89.0    72              18
Apr      82  87.0    20               6
May     132   NaN    52              11
Jun     210  60.0    55              17

In [77]:
df.index

Index(['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun'], dtype='object', name='month')

### Working with string values

In [78]:
df.index = df.index.str.upper()

In [79]:
df

       eggs  salt  spam  dozens_of_eggs
month
JAN      47  12.0    17               3
FEB     110  50.0    31               9
MAR     226  89.0    72              18
APR      82  87.0    20               6
MAY     132   NaN    52              11
JUN     210  60.0    55              17

In [80]:
df.index = df.index.map(str.lower)

In [81]:
df

       eggs  salt  spam  dozens_of_eggs
month
jan      47  12.0    17               3
feb     110  50.0    31               9
mar     226  89.0    72              18
apr      82  87.0    20               6
may     132   NaN    52              11
jun     210  60.0    55              17

In [82]:
df['salty_eggs'] = df.salt + df.dozens_of_eggs

In [83]:
df

       eggs  salt  spam  dozens_of_eggs  salty_eggs
month
jan      47  12.0    17               3        15.0
feb     110  50.0    31               9        59.0
mar     226  89.0    72              18       107.0
apr      82  87.0    20               6        93.0
may     132   NaN    52              11         NaN
jun     210  60.0    55              17        77.0